# -*- coding: utf-8 -*-
import pandas as pd
import time
import csv
start=time.time()
# df=pd.read_excel(r"C:/Users/Administrator/Desktop/20秋教辅发货(大数据).xlsx")
# df["书名"]=df["书名"].str.replace(" ","")
with open("C:/Users/Administrator/Desktop/20秋教辅发货(大数据).csv") as f:
    lines=list(csv.reader(f))
header,values=lines[0],lines[1:]
df={h:v for h,v in zip(header,zip(*values))}
df1=pd.DataFrame(df)
df1["书名"]=df1["书名"].str.replace(" ","")
def changename(x):
    if "课时练语文三年级上册（人教）20秋（总社）" in x:
        x="课时练语文三年级上册（人教）20秋（总社）书+卷 "
    elif "课时练语文四年级上册（人教）20秋（总社）" in x:
        x = "课时练语文四年级上册（人教）20秋（总社）书+卷 "
    elif "课时练语文五年级上册（人教）20秋（总社）" in x:
        x = "课时练语文五年级上册（人教）20秋（总社）书+卷 "
    elif "课时练语文六年级上册（人教）20秋（总社）" in x:
        x = "课时练语文六年级上册（人教）20秋（总社）书+卷 "
    elif "课时练语文七年级上册（人教）20秋（总社）" in x:
        x = "课时练语文七年级上册（人教）20秋（总社）书+卷 "
    elif "课时练语文八年级上册（人教）20秋（总社）" in x:
        x = "课时练语文八年级上册（人教）20秋（总社）书+卷 "
    elif "课时练数学三年级上册（人教）20秋(总社)" in x:
        x = "课时练数学三年级上册（人教）20秋(总社) 书+卷 "
    elif "课时练数学四年级上册（人教）20秋(总社)" in x:
        x = "课时练数学四年级上册（人教）20秋(总社) 书+卷 "
    elif "课时练数学五年级上册（人教）20秋(总社)" in x:
        x = "课时练数学五年级上册（人教）20秋(总社) 书+卷 "
    elif "课时练数学六年级上册（人教）20秋(总社)" in x:
        x = "课时练数学六年级上册（人教）20秋(总社) 书+卷 "
    elif "课时练数学七年级上册（人教）20秋（总社）" in x:
        x = "课时练数学七年级上册（人教）20秋（总社） 书+卷 "
    elif "课时练数学八年级上册（人教）20秋（总社）" in x:
        x = "课时练数学八年级上册（人教）20秋（总社） 书+卷 "
    elif "基本功训练英语三年级上册（冀教三起）20秋(本版)" in x:
        x = "基本功训练 英语三年级上册（冀教三起）20秋(本版)书+卷 "
    elif "基本功训练英语四年级上册（冀教三起）20秋(本版)" in x:
        x = "基本功训练 英语四年级上册（冀教三起）20秋(本版)书+卷 "
    elif "基本功训练英语五年级上册（冀教三起）20秋(本版)" in x:
        x = "基本功训练 英语五年级上册（冀教三起）20秋(本版)书+卷 "
    elif "基本功训练英语六年级上册（冀教三起）20秋(本版)" in x:
        x = "基本功训练 英语六年级上册（冀教三起）20秋(本版)书+卷 "
    elif "同步练习册英语七年级上册（冀教）20秋（本版）" in x:
        x = "同步练习册 英语七年级上册（冀教）20秋（本版）书+卷 "
    elif "同步练习册英语八年级上册（冀教）20秋（本版）" in x:
        x = "同步练习册 英语八年级上册（冀教）20秋（本版）书+卷 "
    elif "能力培养与测试物理八年级上册（教科）20秋（总社）" in x:
        x = "能力培养与测试物理八年级上册（教科）20秋（总社）书+卷 "
    elif "物理学生活动手册物理八年级上册（教科）20秋" in x:
        x = "物理学生活动手册物理八年级上册（教科）20秋 书+卷 "
    return x
df1["书名"]=df1["书名"].apply(changename)
df1.to_csv(r"C:/Users/Administrator/Desktop/123.csv")
endtime=time.time()
print(str(endtime-start)+"秒")